** Calendar
#+BEGIN_SRC emacs-lisp
  (defun load-if-exists (f)
    "load the elisp file only if it exists and is readable"
    (if (file-readable-p f)
        (load-file f)))

  ;; sync gcal
  (setq package-check-signature nil)
  (use-package org-gcal
    :after org
    :config
    (load-if-exists "~/dotfiles/secret/org_gcal.el")
    )
  ;; sync whenever we load agenda
  (add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
  (add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
#+END_SRC

#+RESULTS:
| lambda | nil | (org-gcal-sync) |

